app/controllers/products_controller.rb

INSERT INTO "products" ("comments", "created_at", "dimensions", "name", "photo", "precool_capacity", "price_new", "production_dates", "updated_at", "vending_capacity", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def create
  @product = Product.new(product_params)

  if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "vending_capacity" = ?, "precool_capacity" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["vending_capacity", "44  8oz bottles"], ["precool_capacity", "9 8oz bottles"], ["updated_at", Wed, 18 Dec 2013 17:24:42 UTC +00:00]]
---
def update
  @product = Product.find(params[:id])

  if @product.update_attributes(product_params)