app/controllers/reviews_controller.rb

  def create
    @review = @product.reviews.build(review_params)
    @review.user_id = current_user.id


    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "product_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)

  def load_product
    @product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]