app/views/products/show.html.erb


  <% @product.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]